# Напишіть программу "Касир в кінотеатрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік.
# - якщо користувачу менше 7 - вивести "Тобі ж <>! Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Тобі лише <>, а це е фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Вам <>? Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!) - вивести "О, вам <>! Який цікавий вік!"
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <>, білетів всеодно нема!"
# Замість <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік
# Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача.
# Наприклад :
# "Тобі ж 5 років! Де твої батьки?"
# "Вам 81 рік? Покажіть пенсійне посвідчення!"
# "О, вам 33 роки! Який цікавий вік!"
# Після отримання відповіді програма повинна спитати користувача, чи хоче він повторити виконання.
# Користувач відповідає Yes або No. У випадку коли користувач відповів Yes програма повторюється, No - завершується.
# Користувач повинен мати змогу повторити виконання програми необмежену кількість разів.
# Зробіть все за допомогою функцій! Для кожної функції пропишіть докстрінг або тайпхінтінг.
# Не забувайте що кожна функція має виконувати тільки одне завдання і про правила написання коду.

def age_check(age):
    """This function checks age of user and returns answer"""
    if age < 7:
        return f"Тобі ж {age} {get_year(age)}! Де твої батьки?"
    elif age < 16:
        return f"Тобі лише {age}, а це е фільм для дорослих!"
    elif age > 65:
        return f"Вам {age} {get_year(age)}? Покажіть пенсійне посвідчення!"
    elif age % 11 == 0:
        return f"О, вам {age} {get_year(age)}! Який цікавий вік!"
    else:
        return f"Незважаючи на те, що вам {age} {get_year(age)}, білетів всеодно нема!"

def get_year(age):
    """Take age as arg, return string"""
    if age % 10 == 1 and age != 11:
        return "рік"
    elif age % 10 in (2, 3, 4) and age not in (12, 13, 14):
        return "роки"
    else:
        return "років"

def main():
    """Main function"""
    while True:
        user_age = int(input("Скільки вам років? "))
        print(age_check(user_age))
        user_answer = input("Хочете повторити виконання? (Yes/No) ")
        if user_answer == "Yes":
            continue
        elif user_answer == "No":
            break
        else:
            print("Неправильна відповідь!")
            break

if __name__ == "__main__":
    main()




